const mappings = {"А": "A","а": "a","Ә": "Ä","ә": "ä","Б": "B","б": "b","В": "V","в": "v","Г": "G","г": "g","Ғ": "Ğ","ғ": "ğ","Д": "D","д": "d","Е": "E","е": "e","Ё": "E","ё": "e","Ж": "J","ж": "j","З": "Z","з": "z","И": "İ","и": "i","Й": "İ","й": "i","К": "K","к": "k","Қ": "Q","қ": "q","Л": "L","л": "l","М": "M","м": "m","Н": "N","н": "n","Ң": "Ƞ","ң": "ƞ","О": "O","о": "o","Ө": "Ö","ө": "ö","П": "P","п": "p","Р": "R","р": "r","С": "S","с": "s","Т": "T","т": "t","У": "U","у": "u","Ұ": "Ū","ұ": "ū","ү": "Ü","ү": "ü","Ф": "F","ф": "f","Х": "H","х": "h","Һ": "H","һ": "h","Ц": "S","ц": "s","Ч": "Tş","ч": "tş","Ш": "Ş","ш": "ş","Щ": "Ş","щ": "ş","Ы": "Y","ы": "y","І": "I","і": "ı","Э": "E","э": "e","Ю": "Yu","ю": "yu","Я": "Ya","я": "ya","Ь": "","ь": "","Ъ": "","ъ": "",}

function transliterate(word){
    return word.split('').map(function (char) { 
        return mappings[char] || char
    }).join("");
}

module.exports.transliterate = transliterate